file/Origami/2019/07/13/index.org
# -*- coding: utf-8 -*-

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:nil
#+options: html5-fancy:nil tex:t
#+html_doctype: xhtml-strict
#+html_container: div
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_head:
#+html_head_extra:
#+subtitle:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.2.4)
#+latex_header:

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:t
#+options: d:(not "LOGBOOK") date:nil e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:nil todo:t |:t
#+title: Origami 书籍及公开课介绍
#+date: <2019-07-13 周六>
#+author:
#+email: Mr.NLP@BOJACK
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.2 (Org mode 9.2.4)

#+setupfile: c:/Users/Mr.NLP/Desktop/Org-Web/setup/theme-Raspberry_Pi-local.setup

[[http://langorigami.com/][Robert.J.Lang]] 是当之为愧的折纸大师，可以先看看这个 TED 视频：
#+begin_comment
Copied from TeD
#+end_comment
#+begin_export html
<div style="max-width:854px">
  <div style="position:relative;height:0;padding-bottom:56.25%">
    <iframe
      src="https://embed.ted.com/talks/robert_lang_folds_way_new_origami"
      width="854"
      height="480"
      style="position:absolute;left:0;top:0;width:100%;height:100%"
      frameborder="0"
      scrolling="no"
      allowfullscreen>
    </iframe>
  </div>
</div>
#+end_export

Robert 有一本书可谓折纸“圣经”——[[https://langorigami.com/publication/origami-design-secrets-2nd-edition/][Origami Design Secrets: Mathematical Methods for an Ancient Art, 2nd Edition]]，在这本书的致谢部分提到了一位“神童”，他就是 [[http://erikdemaine.org/][Erik Demaine]]，
算法导论授课者之一，他的课程 [[http://courses.csail.mit.edu/6.849/spring17/][6.849: Geometric Folding Algorithms: Linkages, Origami, Polyhedra]] 讲授几何折叠算法，包括 Origami，配套教材就是上面提到的 Robert 的书还有自己
写的那本 [[http://www.gfalop.org/][Geometric Folding Algorithms: Linkages, Origami, Polyhedra]]。想做手工的可以参考这两本教材，上班族可以自行在书籍配套网站找购买链接，学生可以在学校购买的数据库中搜一下
电子版。目前为止，母校数据库前者只能找到第 1 版。
