file/Origami/2019/07/13/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-13 周六 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Origami 书籍及公开课介绍</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="c:/Users/Mr.NLP/Desktop/Org-Web/style/Raspberry_Pi/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Origami 书籍及公开课介绍</h1>
<p>
<a href="http://langorigami.com/">Robert.J.Lang</a> 是当之为愧的折纸大师，可以先看看这个 TED 视频：
</p>

<div style="max-width:854px">
  <div style="position:relative;height:0;padding-bottom:56.25%">
    <iframe
      src="https://embed.ted.com/talks/robert_lang_folds_way_new_origami"
      width="854"
      height="480"
      style="position:absolute;left:0;top:0;width:100%;height:100%"
      frameborder="0"
      scrolling="no"
      allowfullscreen>
    </iframe>
  </div>
</div>

<p>
Robert 有一本书可谓折纸“圣经”——<a href="https://langorigami.com/publication/origami-design-secrets-2nd-edition/">Origami Design Secrets: Mathematical Methods for an Ancient Art, 2nd Edition</a>，在这本书的致谢部分提到了一位“神童”，他就是 <a href="http://erikdemaine.org/">Erik Demaine</a>，
算法导论授课者之一，他的课程 <a href="http://courses.csail.mit.edu/6.849/spring17/">6.849: Geometric Folding Algorithms: Linkages, Origami, Polyhedra</a> 讲授几何折叠算法，包括 Origami，配套教材就是上面提到的 Robert 的书还有自己
写的那本 <a href="http://www.gfalop.org/">Geometric Folding Algorithms: Linkages, Origami, Polyhedra</a>。想做手工的可以参考这两本教材，上班族可以自行在书籍配套网站找购买链接，学生可以在学校购买的数据库中搜一下
电子版。目前为止，母校数据库前者只能找到第 1 版。
</p>
</div>
<div id="postamble" class="status">
<p class="date">Updated: 2019-07-13 周六 19:26</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
